{"type": "finding", "id": "v1-constraint-finder-001", "title": "Model API cost constraints not specified", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "Goals", "issue": "Success criteria includes '<30 min to run' but doesn't specify model tiering strategy or API cost budget. Running 5 personas could use Opus (expensive) or Sonnet (cheaper), significantly affecting monthly budget.", "why_it_matters": "Without cost constraints, implementation might exceed $2000/month budget. At ~$15 per Opus request * 5 personas * multiple test runs, costs could spiral. CLAUDE.md specifies model tiering but this design doesn't reference it.", "suggestion": "Add explicit cost constraint: 'Use Sonnet for all 5 personas (not Opus). Target <$5 per full review run. Document expected token usage and monthly cost projection based on expected usage frequency.'"}
{"type": "finding", "id": "v1-constraint-finder-002", "title": "Concurrency limits not documented", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "Implementation Notes", "issue": "Design mentions 5 personas running but doesn't specify whether they run sequentially or in parallel. Claude API has rate limits (requests/min) that could block parallel execution.", "why_it_matters": "Sequential execution: 5 * 5min = 25min. Parallel execution: ~5-10min but may hit rate limits or require retry logic. Affects the '<30 min to run' success criterion and implementation complexity.", "suggestion": "Document concurrency strategy: 'Run personas sequentially (MVP) to avoid rate limits. Parallel execution deferred to post-MVP after rate limit handling is proven.' Or specify parallel with rate limit handling requirements."}
{"type": "finding", "id": "v1-constraint-finder-003", "title": "Input document size limits unstated", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "Workflow Integration", "issue": "Design assumes input is 'docs/plans/YYYY-MM-DD-<topic>-design.md' but doesn't specify maximum document size. Claude has 200K token context window; very large design docs might exceed persona context capacity.", "why_it_matters": "If design doc is >150K tokens (after persona prompt), review will fail. Need either size validation upfront or chunking strategy for large docs. Affects feasibility for complex projects.", "suggestion": "Add constraint: 'Design doc must be <100K tokens (~75K words). Skill validates size before processing and errors with actionable message if exceeded. Chunking strategy deferred to post-MVP.'"}
{"type": "finding", "id": "v1-constraint-finder-004", "title": "File system permissions and security not addressed", "severity": "Minor", "phase": {"primary": "calibrate", "contributing": null}, "section": "Implementation Notes", "issue": "Design writes to docs/reviews/ but doesn't specify permission requirements or handling of existing files. What happens if directory doesn't exist? If files already exist (re-run scenario)? If disk is full?", "why_it_matters": "Without error handling spec, implementation could silently fail or overwrite previous review data. Users might lose findings from previous runs or get confusing errors.", "suggestion": "Specify: 'Create output directory if missing. If findings files exist, append timestamp suffix (findings-v1-<persona>-<timestamp>.jsonl) to preserve previous runs. Handle disk full errors with clear message.'"}
{"type": "finding", "id": "v1-constraint-finder-005", "title": "Network dependency not documented", "severity": "Minor", "phase": {"primary": "calibrate", "contributing": null}, "section": "Goals", "issue": "Skill requires Claude API access but design doesn't mention network as a dependency or failure mode. What happens if API is down or rate-limited during review?", "why_it_matters": "If network fails mid-review (e.g., 3/5 personas complete), user loses partial work and time. Needs either resume capability or clear failure message. Affects '<30 min to run' if retries needed.", "suggestion": "Document dependency: 'Requires Claude API access. On network/API failure, skill exits with clear error and preserves any completed persona findings. User can manually re-run missing personas. Automatic retry deferred to post-MVP.'"}
{"type": "finding", "id": "v1-constraint-finder-006", "title": "Prompt caching budget assumptions unstated", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "Implementation Notes", "issue": "CLAUDE.md mentions prompt caching (90% cost reduction) but design doesn't specify whether personas share cached context. If each persona re-reads design doc without caching, costs increase 10x.", "why_it_matters": "Without prompt caching strategy, a single review could cost $50 instead of $5. Affects monthly budget feasibility (160 reviews/month vs 16 reviews/month within $2000 limit). Critical for cost constraint validation.", "suggestion": "Specify caching strategy: 'Use prompt caching for design doc content across all 5 personas (shared cache). Document prompt structure requirements for cache effectiveness. Measure cache hit rates in testing to validate cost projections.'"}
{"type": "finding", "id": "v1-constraint-finder-007", "title": "Git repository dependency assumed but not validated", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "Workflow Integration", "issue": "Output paths use 'docs/reviews/' which assumes repo structure exists. Design doesn't specify whether skill validates git repo presence or handles non-git projects.", "why_it_matters": "CLAUDE.md states 'git-tracked' but if user runs skill outside repo context (e.g., testing on non-git design doc), skill will fail. Affects usability and test case flexibility.", "suggestion": "Add constraint: 'Skill requires execution within parallax git repository. Validate repo presence before processing. For non-repo usage, error with: Create git repo or use absolute path for output. Standalone mode deferred to post-MVP.'"}
{"type": "finding", "id": "v1-constraint-finder-008", "title": "Test case data availability unstated", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "MVP Scope - Test Cases", "issue": "Test cases mention 'if accessible' for claude-ai-customize and openclaw sessions. Design doesn't specify minimum required test cases if these are unavailable or contingency plan.", "why_it_matters": "If only 1-2 test cases available (parallax self-test), validation will be weak. Need minimum N for statistical confidence in precision/recall metrics (>70% precision target requires multiple runs).", "suggestion": "Specify minimum test requirement: 'Need 3+ test cases for MVP validation. If openclaw/claude-ai-customize unavailable, generate synthetic test cases from parallax v1/v2/v3 design stages or defer validation until real cases available.'"}
