{"type": "finding", "id": "v1-assumption-hunter-001", "title": "Design doc location/naming convention assumed to be stable", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "Workflow Integration", "issue": "The workflow assumes design docs are always at docs/plans/YYYY-MM-DD-<topic>-design.md but doesn't specify how <topic> is determined, whether naming is enforced, or what happens if brainstorming skill changes output location", "why_it_matters": "If the brainstorming skill uses different naming conventions or the user manually creates design docs with different names, --light mode won't know which file to read", "suggestion": "Either: (1) Accept design doc path as explicit parameter (--input flag), or (2) Document that this depends on brainstorming skill's file naming convention and will break if that changes, or (3) Implement file discovery logic (find most recent design doc in docs/plans/)"}
{"type": "finding", "id": "v1-assumption-hunter-002", "title": "Topic extraction from filename assumed to work reliably", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "Output Format", "issue": "Output path docs/reviews/<topic>-requirements-light/ assumes <topic> can be extracted from input filename, but doesn't specify extraction logic or handle edge cases (spaces, special chars, date collisions)", "why_it_matters": "If topic extraction is ambiguous (e.g., 'YYYY-MM-DD-foo-bar-design.md' - is topic 'foo' or 'foo-bar'?), output directories could collide or be unpredictable", "suggestion": "Specify topic extraction algorithm: 'strip YYYY-MM-DD- prefix, strip -design.md suffix, what remains is topic' and handle edge cases (sanitize special chars, collision resolution)"}
{"type": "finding", "id": "v1-assumption-hunter-003", "title": "Parallel persona execution assumed possible", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "MVP Scope", "issue": "Design mentions '<30 min to run' but doesn't specify whether 5 personas run sequentially (5x time) or in parallel (1x time). If sequential, 30 min implies ~6 min per persona. If parallel, assumes infrastructure supports concurrent execution", "why_it_matters": "If personas run sequentially and each takes 10 min, total runtime is 50 min (fails success criteria). If parallel execution is required, implementer needs to know this constraint", "suggestion": "Specify execution model: 'Personas SHOULD run in parallel (using dispatching-parallel-agents pattern) to meet <30 min target' or 'Sequential execution acceptable, each persona must complete in <6 min'"}
{"type": "finding", "id": "v1-assumption-hunter-004", "title": "Single design doc per project assumed", "severity": "Minor", "phase": {"primary": "calibrate", "contributing": null}, "section": "Workflow Integration", "issue": "Workflow assumes one design doc exists per topic, but doesn't handle iterative design scenarios where multiple dated design docs might exist (e.g., 2026-02-15-foo-design.md, 2026-02-16-foo-design.md)", "why_it_matters": "If user iterates on design after initial brainstorming, --light mode might review wrong version or create conflicting output directories", "suggestion": "Either: (1) Clarify that --light should only run once per topic (after first brainstorm), or (2) Support review of specific design doc version with explicit path parameter"}
{"type": "finding", "id": "v1-assumption-hunter-005", "title": "JSONL schema availability assumed", "severity": "Critical", "phase": {"primary": "calibrate", "contributing": null}, "section": "Output Format", "issue": "Design states 'reuses existing reviewer-findings-v1.0.0.schema.json' but doesn't specify schema location, versioning strategy, or what happens if schema evolves", "why_it_matters": "If schema file is moved, renamed, or updated to v1.1.0, personas won't know which schema to use or where to find it. Implementer doesn't know whether to copy schema, reference it, or inline it", "suggestion": "Specify schema location (e.g., 'schemas/reviewer-findings-v1.0.0.schema.json'), document that personas MUST validate against this exact version, and clarify schema discovery mechanism"}
{"type": "finding", "id": "v1-assumption-hunter-006", "title": "User knows when to invoke --light mode", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "Workflow Integration", "issue": "Manual workflow requires user to remember to invoke --light after brainstorming, but doesn't specify how users discover this skill exists, when it should be invoked, or why they'd remember to use it", "why_it_matters": "If users don't know the skill exists or forget to invoke it, value is lost. Success criteria includes 'users naturally remember to invoke after brainstorming' but provides no mechanism to achieve this", "suggestion": "Add discovery mechanism: (1) Document in brainstorming skill output ('Next: run /requirements --light'), or (2) Add prompt to Claude Code after brainstorming completes, or (3) Accept that MVP relies on user education and document this assumption"}
{"type": "finding", "id": "v1-assumption-hunter-007", "title": "Test cases assumed to be accessible", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "MVP Scope", "issue": "Test plan lists 'openclaw design sessions' and 'claude-ai-customize brainstorm' but MEMORY.md notes openclaw repo is inaccessible and test case availability hasn't been verified", "why_it_matters": "If test cases aren't accessible, MVP validation can't proceed. Design doesn't specify fallback strategy or how to handle missing test artifacts", "suggestion": "Verify test case availability before implementation OR specify fallback: 'If past brainstorms inaccessible, synthesize test cases or defer MVP validation until new brainstorms completed'"}
{"type": "finding", "id": "v1-assumption-hunter-008", "title": "Summary synthesis approach not specified", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "Output Format", "issue": "Design specifies summary.md output with 'finding counts by severity, key themes, actionable next steps' but doesn't specify who generates it (6th synthesizer persona? Post-processing script? User manually?) or what synthesis logic to use", "why_it_matters": "If summary generation is manual, adds user burden. If it's a 6th persona, extends runtime beyond 30 min. If it's reusing parallax:review synthesizer, that dependency isn't documented", "suggestion": "Specify synthesis approach: (1) Add 6th synthesizer persona (document runtime impact), or (2) Reuse parallax:review synthesis logic (document dependency), or (3) Defer summary to post-MVP and document manual synthesis process"}
{"type": "finding", "id": "v1-assumption-hunter-009", "title": "Persona expertise level assumed sufficient", "severity": "Minor", "phase": {"primary": "calibrate", "contributing": null}, "section": "Reviewer Personas", "issue": "Personas defined with focus areas and blind spot checks, but doesn't specify expected expertise level, model to use (Sonnet vs Opus), or whether personas need domain-specific context", "why_it_matters": "If Sonnet-level personas produce low-quality findings, MVP might fail validation. If Opus required, runtime/cost implications need to be known upfront", "suggestion": "Specify persona implementation: 'Use Sonnet for all personas (consistent with design review baseline from ADR-003)' and 'Personas review with general software engineering expertise, no domain-specific context required'"}
{"type": "finding", "id": "v1-assumption-hunter-010", "title": "Finding ID collision prevention not addressed", "severity": "Minor", "phase": {"primary": "calibrate", "contributing": null}, "section": "Output Format", "issue": "Finding IDs follow pattern 'v1-<persona>-NNN' but doesn't specify how NNN is generated, whether it's zero-padded, or how to prevent collisions if persona runs twice on same design doc", "why_it_matters": "If --light runs multiple times on same doc (e.g., after design updates), finding IDs might collide. If NNN isn't zero-padded, sorting becomes non-intuitive (v1-foo-2 after v1-foo-10)", "suggestion": "Specify ID generation: 'NNN is zero-padded 3-digit sequence starting at 001' and 'Each run generates new finding IDs (no collision detection needed, findings are version-specific)'"}
{"type": "finding", "id": "v1-assumption-hunter-011", "title": "Success criteria measurement assumed feasible", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "MVP Scope", "issue": "MVP validation requires measuring 'precision >70%' and 'recall >60%' but doesn't specify how to establish ground truth for 'real gaps' vs 'false positives' or who makes this judgment", "why_it_matters": "Precision/recall require ground truth dataset. If ground truth is 'user judgment', results are subjective. If it's 'actual rework that happened', historical data might not exist or be difficult to correlate", "suggestion": "Specify validation approach: (1) User manually labels each finding as 'real gap' vs 'false positive' (precision only, no recall baseline), or (2) Compare to known historical issues (requires accessible ground truth), or (3) Use LLM-as-judge for validation (document this as evaluation strategy)"}
{"type": "finding", "id": "v1-assumption-hunter-012", "title": "Dependency on superpowers plugin brainstorming skill not versioned", "severity": "Important", "phase": {"primary": "calibrate", "contributing": null}, "section": "Workflow Integration", "issue": "Design assumes brainstorming skill outputs to docs/plans/YYYY-MM-DD-<topic>-design.md but superpowers plugin is external dependency with no version pinning or compatibility contract", "why_it_matters": "If superpowers plugin changes brainstorming output location, format, or filename convention, --light mode breaks. No mechanism to detect or handle this breakage", "suggestion": "Document dependency explicitly: 'Requires superpowers plugin brainstorming skill v[version] with docs/plans/ output convention' OR make --light mode accept explicit input path to decouple from brainstorming output conventions"}
